siva100403/CHEWIE_ASBV21/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LS_SENSE_FLAP_GPIO GPIO5               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LS_SENSE_FLAP_GPIO_PIN 2U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_LS_SENSE_FLAP_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LS_SENSE_FLAP_PORT PORT5               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LS_SENSE_FLAP_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LS_SENSE_FLAP_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT5_3 (number 51), LS_SENSE_ST
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LS_SENSE_ST_GPIO GPIO5               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LS_SENSE_ST_GPIO_PIN 3U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_LS_SENSE_ST_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LS_SENSE_ST_PORT PORT5               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LS_SENSE_ST_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LS_SENSE_ST_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_21 (number 56), LS_SENSE_LIDCLOSE
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LS_SENSE_LIDCLOSE_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LS_SENSE_LIDCLOSE_GPIO_PIN 21U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_LS_SENSE_LIDCLOSE_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LS_SENSE_LIDCLOSE_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LS_SENSE_LIDCLOSE_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LS_SENSE_LIDCLOSE_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PORT3_20 (number 57), LS_SENSE_LIDOPEN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LS_SENSE_LIDOPEN_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LS_SENSE_LIDOPEN_GPIO_PIN 20U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_LS_SENSE_LIDOPEN_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LS_SENSE_LIDOPEN_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LS_SENSE_LIDOPEN_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LS_SENSE_LIDOPEN_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT3_17 (number 60), RTC_INT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RTC_INT_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RTC_INT_GPIO_PIN 17U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_RTC_INT_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RTC_INT_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RTC_INT_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RTC_INT_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT3_16 (number 61), HEATER_CTRL
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_HEATER_CTRL_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_HEATER_CTRL_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_HEATER_CTRL_GPIO_PIN 16U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_HEATER_CTRL_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_HEATER_CTRL_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_HEATER_CTRL_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_HEATER_CTRL_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT3_15 (number 62), SHD_DIR_CTRL
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SHD_DIR_CTRL_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SHD_DIR_CTRL_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_SHD_DIR_CTRL_GPIO_PIN 15U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SHD_DIR_CTRL_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SHD_DIR_CTRL_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SHD_DIR_CTRL_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SHD_DIR_CTRL_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT3_14 (number 63), SHD_ONOFF_CTRL
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SHD_ONOFF_CTRL_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SHD_ONOFF_CTRL_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_SHD_ONOFF_CTRL_GPIO_PIN 14U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SHD_ONOFF_CTRL_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SHD_ONOFF_CTRL_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SHD_ONOFF_CTRL_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SHD_ONOFF_CTRL_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORT3_13 (number 64), SPARE1_CTRL
  @{ */

