siva100403/CHEWIE_ASBV21/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SPARE1_CTRL_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SPARE1_CTRL_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_SPARE1_CTRL_GPIO_PIN 13U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SPARE1_CTRL_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SPARE1_CTRL_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPARE1_CTRL_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPARE1_CTRL_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT3_12 (number 65), LID_REV_CTRL
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LID_REV_CTRL_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LID_REV_CTRL_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_LID_REV_CTRL_GPIO_PIN 12U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_LID_REV_CTRL_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LID_REV_CTRL_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LID_REV_CTRL_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LID_REV_CTRL_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT3_6 (number 72), I2C_EEPROM_SCK
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_I2C_EEPROM_SCK_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_I2C_EEPROM_SCK_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_I2C_EEPROM_SCK_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORT3_1 (number 74), I2C_EEPROM_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_I2C_EEPROM_SDA_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_I2C_EEPROM_SDA_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_I2C_EEPROM_SDA_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORT0_16 (number 84), UART_RXD_HMI
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_UART_RXD_HMI_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_UART_RXD_HMI_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_UART_RXD_HMI_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT0_17 (number 85), UART_TXD_HMI
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_UART_TXD_HMI_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_UART_TXD_HMI_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_UART_TXD_HMI_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT0_18 (number 86), ASB_HMI_INT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ASB_HMI_INT_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ASB_HMI_INT_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_ASB_HMI_INT_GPIO_PIN 18U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ASB_HMI_INT_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ASB_HMI_INT_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ASB_HMI_INT_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ASB_HMI_INT_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT0_20 (number 88), UART_RXD_DBG
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_UART_RXD_DBG_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_UART_RXD_DBG_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_UART_RXD_DBG_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT0_21 (number 89), UART_TXD_DBG
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_UART_TXD_DBG_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_UART_TXD_DBG_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_UART_TXD_DBG_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
